In [11]:
import numpy as np
import pandas as pd

with np.load('simplified-recipes-1M.npz', allow_pickle=True) as data:
    recipes = data['recipes']
    ingredients = data['ingredients']
    
print(type(recipes), type(ingredients))

rdf = pd.DataFrame(recipes)
idf = pd.DataFrame(ingredients)

<class 'numpy.ndarray'> <class 'numpy.ndarray'>

In [12]:
rdf.head()

                                                   0
0  [233, 2754, 42, 120, 560, 345, 150, 2081, 12, 21]
1  [198, 249, 2, 194, 1884, 791, 965, 423, 53, 48...
2  [328, 263, 62, 46, 445, 55, 1196, 82, 664, 3, ...
3                                        [988, 1307]
4  [14, 1117, 998, 1010, 9, 30, 18, 29, 214, 1752...

In [13]:
idf.head()

        0
0    salt
1  pepper
2  butter
3  garlic
4   sugar